var u = [
'̍','̎','̄','̅',
'̿','̑','̆','̐',
'͒','͗','͑','̇',
'̈','̊','͂','̓',
'̈','͊','͋','͌',
'̃','̂','̌','͐',
'̀','́','̋','̏',
'̒','̓','̔','̽',
'̉','ͣ','ͤ','ͥ',
'ͦ','ͧ','ͨ','ͩ',
'ͪ','ͫ','ͬ','ͭ',
'ͮ','ͯ','̾','͛',
'͆','̚'
];


var d = [
      '̖','̗','̘','̙',
      '̜','̝','̞','̟',
      '̠','̤','̥','̦',
      '̩','̪','̫','̬',
      '̭','̮','̯','̰',
      '̱','̲','̳','̹',
      '̺','̻','̼','ͅ',
      '͇','͈','͉','͍',
      '͎','͓','͔','͕',
      '͖','͙','͚','̣'];


var mid = [
      '̕','̛','̀','́',
      '͘','̡','̢','̧',
      '̨','̴','̵','̶',
      '͏','͜','͝','͞',
      '͟','͠','͢',' ','̸',
      '̷',' ͡',' ҉','_]',''];

var sys = require('sys');
sys.puts(u, d, mid);



var zalgo = {};
zalgo.heComes = function(){
  
};

zalgo.heComes = function(text, options){
  
  text = text.split('');
  for(var l in text){
    sys.puts(text[l]);
  }
  
  return text;
};

sys.puts(zalgo.heComes('fuck fuck fuck we are dead.'));

